ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c


/**
 * main.c
 *
 * 1MHz main clock & sub main clock (MCLK & SMCLK)
 * 1kHz PWM cycle with 1000 duty rate
 *
 *
 */

#include <msp430.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <SSD1306.h>
#include <i2c.h>
#include <HDC1080_I2C_GPIO.h>
#include <adc.h>

#define CPU_F ((double)1000000)
#define delay_us(x) __delay_cycles((long)(CPU_F*(double)x/1000000.0))
#define delay_ms(x) __delay_cycles((long)(CPU_F*(double)x/1000.0))

/////////////////////////////////////////////////////////////
//                      EXT INT
/////////////////////////////////////////////////////////////
// SW1 = P1.3
#define SW1_PORT_DIR            P1DIR
#define SW1_PORT_OUT            P1OUT
#define SW1_PORT_REN            P1REN
#define SW1_PORT_IES            P1IES
#define SW1_PORT_IE             P1IE
#define SW1_PORT_IFG            P1IFG
#define SW1_BIT                 BIT3

// SW2 = P1.4
#define SW2_PORT_DIR            P1DIR
#define SW2_PORT_OUT            P1OUT
#define SW2_PORT_REN            P1REN
#define SW2_PORT_IES            P1IES
#define SW2_PORT_IE             P1IE
#define SW2_PORT_IFG            P1IFG
#define SW2_BIT                 BIT4

uint8_t switch_status = 0;

// GPIO_P1InterruptSet() : external interrupt setup for P1
// param : bits - multi-bits setup
void GPIO_SWs_Interrupt_Set(void)
{
    SW1_PORT_DIR &= ~SW1_BIT;                         // port as Input
    SW1_PORT_OUT |=  SW1_BIT;                          // Configure P1 as pulled-up
    SW1_PORT_REN |=  SW1_BIT;                          // P1 pull-up register enable
    SW1_PORT_IES &= ~SW1_BIT;                         // P1 edge, 0: low to high edge
    SW1_PORT_IE  |=  SW1_BIT;                          // P1 interrupt enabled
    SW1_PORT_IFG &= ~SW1_BIT;                         // P1 IFG cleared

    SW2_PORT_DIR &= ~SW2_BIT;
    SW2_PORT_OUT |=  SW2_BIT;                          // Configure P2.x as pulled-up
    SW2_PORT_REN |=  SW2_BIT;                          // P2.x pull-up register enable
    SW2_PORT_IES &= ~SW2_BIT;                         // P2.x edge, 0: low to high edge
    SW2_PORT_IE  |=  SW2_BIT;                          // P2.x interrupt enabled
    SW2_PORT_IFG &= ~SW2_BIT;                         // P2.x IFG cleared
}
/////////////////////////////////////////////////////////////
//                      CLOCK
/////////////////////////////////////////////////////////////
#define CLOCK_1MHZ      1
#define CLOCK_4MHZ      2
#define CLOCK_8MHZ      3
#define CLOCK_10MHZ     4
#define CLOCK_12MHZ     5
#define CLOCK_16MHZ     6
#define CLOCK_20MHZ     7
#define CLOCK_24MHZ     8
#define CLOCK_25MHZ     9


void clock_init(uint8_t mclk_spd)
{
    // check if TLV SegmentA is erased or not,
    // especially check clock related data...

    // check if calibration constant erased or not
    if (CALBC1_1MHZ==0xFF ||
        CALBC1_8MHZ==0xFF ||
        CALBC1_12MHZ==0xFF ||
        CALBC1_16MHZ==0xFF)
    {
        // values are calibrated during device manufacturing..
        // default value of CALDCO_xMHZ and CALBC1_xMHZ
        // 1MHz:86, BA, 8MHz: 8D, 82, 12MHz: 8E, 92, 16MHz: 8F, 8E

        // if it is erased, use below 1MHz
        BCSCTL1 = 0x86;
        DCOCTL = 0xBA;
    }

    // setup for MCLK
    switch(mclk_spd)
    {
        case CLOCK_16MHZ :
            BCSCTL1 = CALBC1_16MHZ;                   // Set range
            DCOCTL = CALDCO_16MHZ;                    // Set DCO step + modulation*/
        break;
        case CLOCK_12MHZ :
            BCSCTL1 = CALBC1_12MHZ;                   // Set range
            DCOCTL = CALDCO_12MHZ;                    // Set DCO step + modulation*/
        break;
        case CLOCK_8MHZ :
            BCSCTL1 = CALBC1_8MHZ;                    // Set range
            DCOCTL = CALDCO_8MHZ;                     // Set DCO step + modulation */
        break;
        case CLOCK_1MHZ :
            BCSCTL1 = CALBC1_1MHZ;                    // Set range
            DCOCTL = CALDCO_1MHZ;                     // Set DCO step + modulation */
        break;
        case CLOCK_20MHZ :
        case CLOCK_24MHZ :
        case CLOCK_25MHZ :
            BCSCTL1 = 0x0f;                    // Set range
            DCOCTL = 0xe0;                     // Set DCO step + modulation */
        break;
        default :
            BCSCTL1 = CALBC1_1MHZ;
            DCOCTL = CALDCO_1MHZ;
            break;
    }

    // setup for SMCLK division rate
    if(mclk_spd >= CLOCK_8MHZ)
        BCSCTL2 |= DIVS_3;                    // divide SMCLK by 8(=1/8) if main clock is >= 8MHz
    else
        BCSCTL2 |= DIVS_0;                    // no divide//divide SMCLK by 2(=1/2) if main clock is < 8MHz

    // setup AclK source
    BCSCTL3 |= LFXT1S_0;                  // ACLK : LFXT1 = 32768Hz external Xtal
    //BCSCTL3 |= LFXT1S_2;                  // ACLK : LFXT1 = Internal VLO clk(4~20kHz, typ 12KHz)
}

/////////////////////////////////////////////////////////////
//                      PWM
/////////////////////////////////////////////////////////////

#define TIMER0_SMCLK_100usec            100
#define TIMER0_SMCLK_500usec            500
#define TIMER0_SMCLK_1msec              1000
#define TIMER0_SMCLK_5msec              5000
#define TIMER0_SMCLK_10msec             10000//2500        // = 1/250KHz * 2500 = 10msec
#define TIMER0_SMCLK_50msec             50000
//#define TIMER0_SMCLK_100msec            25000
//#define TIMER0_SMCLK_200msec            50000

#define CONST_TIMER0_CCR0               TIMER0_SMCLK_5msec
//#define CONST_TIMER0_CCR1               TIMER0_SMCLK_500usec
//#define CONST_TIMER0_CCR2               TIMER0_SMCLK_50msec


#define PWM_OUT0_PORT_DIR       P2DIR
#define PWM_OUT0_PORT_SEL0      P2SEL
#define PWM_OUT0_PORT_SEL2      P2SEL2
#define PWM_OUT0_BIT            BIT1

#define PWM_OUT1_PORT_DIR       P2DIR
#define PWM_OUT1_PORT_SEL0      P2SEL
#define PWM_OUT1_PORT_SEL2      P2SEL2
#define PWM_OUT1_BIT            BIT4

#define PWM_SMCLK_2MHZ_PERIOD_100HZ     20000
#define PWM_SMCLK_2MHZ_PERIOD_500HZ     10000
#define PWM_SMCLK_2MHZ_PERIOD_1KHZ      2000
#define PWM_SMCLK_2MHZ_PERIOD_5KHZ      1000
#define PWM_SMCLK_2MHZ_PERIOD_10KHZ     200
#define PWM_SMCLK_2MHZ_PERIOD_50KHZ     100
#define PWM_SMCLK_2MHZ_PERIOD_100KHZ    20

#define PWM_SMCLK_1MHZ_PERIOD_100HZ     10000
#define PWM_SMCLK_1MHZ_PERIOD_500HZ     5000
#define PWM_SMCLK_1MHZ_PERIOD_1KHZ      1000
#define PWM_SMCLK_1MHZ_PERIOD_5KHZ      500
#define PWM_SMCLK_1MHZ_PERIOD_10KHZ     100
#define PWM_SMCLK_1MHZ_PERIOD_50KHZ     50
#define PWM_SMCLK_1MHZ_PERIOD_100KHZ    10

