ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c
#define PWM_PERIOD_COUNT                7       // 100, 500, 1k, 5k, 10k, 50k, 100kHz
#define PWM_DUTY_MIN                    0       // 0%
#define PWM_DUTY_MAX                    100     // 100%
#define PWM_DUTY_STEP_UNDER_10KHZ       1       // 1% step
#define PWM_DUTY_STEP_OVER_10KHZ        10      // 10% step

uint16_t pwm_period = PWM_SMCLK_1MHZ_PERIOD_1KHZ;
uint16_t pwm_duty = 0;

// P2.1, P2.4 as pwm source
void timer1_PWM_init(void)
{
    // PWM port init
    PWM_OUT0_PORT_DIR |= PWM_OUT0_BIT;                     // P1.6 and P1.7 output
    PWM_OUT0_PORT_SEL0 |= PWM_OUT0_BIT;                    // P1.6 and P1.7 options select
    PWM_OUT0_PORT_SEL2 &= ~(PWM_OUT0_BIT);
    // PWM port init
    PWM_OUT1_PORT_DIR |= PWM_OUT1_BIT;                     // P1.6 and P1.7 output
    PWM_OUT1_PORT_SEL0 |= PWM_OUT1_BIT;                    // P1.6 and P1.7 options select
    PWM_OUT1_PORT_SEL2 &= ~(PWM_OUT1_BIT);

    TA1CCR0 = pwm_period;                         // PWM Period 1MHz

    // CCR1 for P2.1
    TA1CCTL1 = OUTMOD_7;                      // CCR1 reset/set
    TA1CCR1 = 0;                            // CCR1 PWM duty cycle

    // CCR2 for P2.4
    TA1CCTL2 = OUTMOD_7;                      // CCR2 reset/set
    TA1CCR2 = 0;                            // CCR2 PWM duty cycle

    TA1CTL = TASSEL_2 | MC_0 | TACLR;  // SMCLK, STOP, clear TAR

    __no_operation();                         // For debugger
}

void timer1_PWM_stop(void)      // 1ms timer
{
    TA1CTL = TASSEL_2 + MC_0 + ID_0;                 // CONTINUOUE MODE/(SMCLK=1,000,000/1(ID_0)= 1MHz
}

void timer1_PWM_start(void)      // 1ms timer
{
    TA1CTL = TASSEL_2 + MC_1 + ID_0;                 // CONTINUOUE MODE/(SMCLK=1,000,000/1(ID_0)= 1MHz
}

// Period : 800
// increase/decrease : 80=>10%, 40=>5%, 4 ==> 0.5%
#define SPEED_MAX   (800-4)
#define SPEED_STEP  8
#define SPEED_START_POINT   392

#define SPEED_START_ON   80
#define SPEED_START_OFF  0

short speed_level = 0;        // 600/800 = 75% duty :: starting duty

void PWM_Generating(short level)
{
    unsigned short duty = 0;
    if(level == SPEED_START_OFF)
    {
        TA0CCTL1 = OUTMOD_5;                      // CCR1 reset/set
        __delay_cycles(1000);
        TA0CTL = MC_0;                          // stop

    }
    else
    {
        duty = (level+1);
        TA0CCR1 = duty;

        TA0CCTL1 = OUTMOD_7;                      // CCR1 reset/set
        TA0CTL = TASSEL_2 | MC_1 | TACLR;  // SMCLK, up mode, clear TAR
    }
}

void pwm_start_stop(uint8_t trigger_onoff)
{
    uint16_t read_period = 0, read_duty = 0;

    read_period = TA0CCR0;
    read_duty = TA0CCR1;

    if(read_period != 0 && read_duty != 0)
    {
        if(trigger_onoff == 1)
        {
            TA0CCTL1 = OUTMOD_7;                        // CCR1 reset/set
            TA0CTL = TASSEL_2 | MC_1 | TACLR;           // SMCLK, up mode, clear TAR
        }
        else
        {
            TA0CCTL1 = OUTMOD_5;                        // CCR1 reset/set
            __delay_cycles(1000);
            TA0CTL = MC_0;                              // stop
        }
    }

}

// 10msec,  50msec, 200msec continuous timer
void timerA0_init(void)
{
    TA0CTL = TASSEL_2 + MC_2 + ID_2;                   // SMCLK, Cont. mode, 1/4 = 1000/4=250kHz
    // CCR0 interrupt enabled : 10msec
    TA0CCTL0 = CCIE;
    TA0CCR0 = CONST_TIMER0_CCR0;
}

#define SIMPLE_GUI       1
#ifdef SIMPLE_GUI
#define MENU_IDLE                       0
#define MENU_PWM0_SETTING               1           // PWM0 duty increase (10~100%)
#define MENU_PWM1_SETTING               2           // PWM1 duty increase (10~100%)
#define MENU_DISP_STATUS                3           // display status (Temperature, Humidity, Vbus voltage, PWM duty increase rate..)
#define MENU_MAX                        4
#else
#define MENU_IDLE                       0
#define MENU_PWM0_SETTING               1           // PWM0 duty increase (10~100%)
#define MENU_PWM1_SETTING               2           // PWM1 duty increase (10~100%)
//#define MENU_LED_CHANGE                 3           // PWM duty change rate
#define MENU_PWM_DUTY_INC_RATE          3           // PWM duty increase rate (5%, 10% or 20%)
#define MENU_PWM_CHANGE_STEP_LINAR      4           // Set PWM duty increase as STEP or LINEAR
#define MENU_LED_ON_TIME_SET            5           // LED ON duration time set
#define MENU_BEEP_ON_OFF                6
#define MENU_DISP_STATUS                7           // display status (Temperature, Humidity, Vbus voltage, PWM duty increase rate..)
#define MENU_MAX                        8
#endif

#define PWM_DEFAULT_DUTY                100         // 10%
#define PWM_MAX_DUTY                    1000        // 100%
uint8_t menu = MENU_PWM0_SETTING;
uint16_t pwm0_duty_target = PWM_DEFAULT_DUTY;
uint16_t pwm1_duty_target = PWM_DEFAULT_DUTY;
uint16_t pwm0_duty = PWM_DEFAULT_DUTY;
uint16_t pwm1_duty = PWM_DEFAULT_DUTY;

#define LED_DIMMING_CHANGE_STEP        1
#define LED_DIMMING_CHANGE_LINEAR      2
uint8_t led_dimming_change_method = LED_DIMMING_CHANGE_STEP;

#define PWM_DUTY_INC_5_PERCENT          50      // 50 = 5%
#define PWM_DUTY_INC_10_PERCENT         100     // 100 = 10%
#define PWM_DUTY_INC_20_PERCENT         200     // 200 = 20%
uint8_t pwm_duty_increase_rate = PWM_DUTY_INC_10_PERCENT;

#define LED_ON_TIME_1HR         1
#define LED_ON_TIME_MAX         12
uint16_t led_on_time_hr = LED_ON_TIME_1HR;                     // led on duration in hour

#define ON                  1
#define OFF                 0
uint8_t beep_on_off = ON;
uint8_t tick_5ms = 0;


int16_t temperature_x10 = 0;    // uint16_t -> int16_t : consider (-) temperature
uint16_t humidity_x10 = 0;
char disp_buf[24];
char tmp_buf[6];
int16_t tmp_data[2];
// ADC Vbat checker
uint8_t g_vbat_decimal_x10 = 0;


const char str_Batt_low[] = "Batt Low : ";
const char str_____Vbat[] = " Vbat    : ";
const char str_dot[] = ".";
const char str_V[] = "V";
const char str_space[] = " ";
const char str__C[] = "'C";
const char str_percent_RH[] = " % RH";
const char str_Error_to_access[] = "Error to access";
const char str_HDC1080[] = "HDC1080..";
const char str_Always_on_mode[] = " Always on mode";
const char str_10sec_on_mode[] = " 10sec on mode";

void vbat_adc_check_display(void)
{
    // ADC battery check
    g_vbat_decimal_x10 = vbat_level_checker();
    //__delay_cycles(1000);


    ///////////////////////////
    // display battery status
    ///////////////////////////
    if(g_vbat_decimal_x10 <= 34)   // low battery check at Vbat <= 3.4V
    {
        strcpy(disp_buf, "Batt Low : ");

        //timerA0_disable();
    }
    else
    {
        strcpy(disp_buf, "    Vbat : ");
    }

