ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c
    tmp_data[0] = g_vbat_decimal_x10 / 10;
    tmp_data[1] = g_vbat_decimal_x10 % 10;
#ifdef CCS_VER9
    ltoa(tmp_data[0], tmp_buf);
#else
    ltoa(tmp_data[0], tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, ".");
#ifdef CCS_VER9
    ltoa(tmp_data[1], tmp_buf);
#else
    ltoa(tmp_data[1], tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "V");
    ssd1306_printString(0, 0, disp_buf, FONT_6x8);                      // display line 0 : Vbat voltage

}


void hdc1080_read_display(void)
{

    if( HDC1080_I2C_check_device_valid(HDC1080_SLAVE_ADDR) )
    {
        HDC1080_I2C_read_temp_and_humidity(HDC1080_SLAVE_ADDR, &temperature_x10, &humidity_x10);

        tmp_data[0] = temperature_x10 / 10;
        tmp_data[1] = temperature_x10 % 10;

#ifdef CCS_VER9
        ltoa(tmp_data[0], tmp_buf);
#else
        ltoa(tmp_data[0], tmp_buf, 10);
#endif
        strcpy(disp_buf, tmp_buf);
        strcat(disp_buf, ".");
#ifdef CCS_VER9
        ltoa(tmp_data[1], tmp_buf);
#else
        ltoa(tmp_data[1], tmp_buf, 10);
#endif
        strcat(disp_buf, tmp_buf);
        strcat(disp_buf, " 'C");
        ssd1306_printString(0, 2, disp_buf, FONT_MS_GOTHIC8x16);

        tmp_data[0] = humidity_x10 / 10;
        tmp_data[1] = humidity_x10 % 10;

#ifdef CCS_VER9
        ltoa(tmp_data[0], tmp_buf);
#else
        ltoa(tmp_data[0], tmp_buf, 10);
#endif
        strcpy(disp_buf, tmp_buf);
        strcat(disp_buf, ".");
#ifdef CCS_VER9
        ltoa(tmp_data[1], tmp_buf);
#else
        ltoa(tmp_data[1], tmp_buf, 10);
#endif
        strcat(disp_buf, tmp_buf);
        strcat(disp_buf, " % RH");
        ssd1306_printString(0, 4, disp_buf, FONT_MS_GOTHIC8x16);
    }
    else
    {
        ssd1306_printString(0, 2, "Error to access", FONT_MS_GOTHIC8x16);

        ssd1306_printString(0, 4, "HDC1080..", FONT_MS_GOTHIC8x16);

    }
}

void display_pwm0H_pwm1L_info(void)
{
    strcpy(disp_buf, "1.PWM0: ");
#ifdef CCS_VER9
    ltoa( (pwm0_duty_target/10), tmp_buf);
#else
    ltoa( (pwm0_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 0, disp_buf, FONT_MS_GOTHIC8x16);          // 0 -> ... -> 100%

    strcpy(disp_buf, "   PWM1 : ");
#ifdef CCS_VER9
    ltoa( (pwm1_duty_target/10), tmp_buf);
#else
    ltoa( (pwm1_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 2, disp_buf, FONT_6x8);
}
void display_pwm1H_pwm0L_info(void)
{
    strcpy(disp_buf, "   PWM0 : ");
#ifdef CCS_VER9
    ltoa( (pwm0_duty_target/10), tmp_buf);
#else
    ltoa( (pwm0_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 0, disp_buf, FONT_6x8);

    strcpy(disp_buf, "2.PWM1: ");
#ifdef CCS_VER9
    ltoa( (pwm1_duty_target/10), tmp_buf);
#else
    ltoa( (pwm1_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 1, disp_buf, FONT_MS_GOTHIC8x16);          // 0 -> ... -> 100%
}
void display_pwm0L_pwm1L_info(void)
{
    strcpy(disp_buf, " PWM0 : ");
#ifdef CCS_VER9
    ltoa( (pwm0_duty_target/10), tmp_buf);
#else
    ltoa( (pwm0_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 0, disp_buf, FONT_6x8);

    strcpy(disp_buf, " PWM1 : ");
#ifdef CCS_VER9
    ltoa( (pwm1_duty_target/10), tmp_buf);
#else
    ltoa( (pwm1_duty_target/10), tmp_buf, 10);
#endif
    strcat(disp_buf, tmp_buf);
    strcat(disp_buf, "%  ");
    ssd1306_printString(0, 1, disp_buf, FONT_6x8);          // 0 -> ... -> 100%
}

uint16_t *Flash_ptr = 0x0000;                          // Flash pointer

void read_infoFlash(void)
{
    Flash_ptr = (uint16_t *) 0x1040;              // Initialize Flash pointer   // information region

    pwm0_duty = pwm0_duty_target = *(Flash_ptr);
    pwm1_duty = pwm1_duty_target = *(Flash_ptr+1);
}

void write_infoFlash(void)
{
    FCTL2 = FWKEY + FSSEL0 + FN1;             // MCLK/3 for Flash Timing Generator

    Flash_ptr = (uint16_t *) 0x1040;              // Initialize Flash pointer   // information region
    FCTL1 = FWKEY + ERASE;                    // Set Erase bit
    FCTL3 = FWKEY;                            // Clear Lock bit
    *Flash_ptr = 0;                           // Dummy write to erase Flash segment

    FCTL1 = FWKEY + WRT;                      // Set WRT bit for write operation

    *Flash_ptr++ = (uint16_t)pwm0_duty;                   // Write value to flash
    *Flash_ptr++ = (uint16_t)pwm1_duty;                   // Write value to flash

    FCTL1 = FWKEY;                            // Clear WRT bit
    FCTL3 = FWKEY + LOCK;                     // Set LOCK bit

}

void main(void)
{
    WDTCTL = WDTPW | WDTHOLD;                   // stop watchdog timer

    clock_init(CLOCK_8MHZ);
    delay_ms(1);

    timer1_PWM_init();

    GPIO_SWs_Interrupt_Set();      // Set P1.2 and P2.6 as interrupt source setup

    // OLED initialization
    i2c_init();                                 // initialize I2C to use with OLED
    delay_ms(1);

    ssd1306_init();                             // Initialize SSD1306 OLED
    ssd1306_clearDisplay();                     // Clear OLED display
    delay_ms(1);

    // HDC1080 init
    GPIO_I2C_Init();

    SW1_PORT_IFG &= ~SW1_BIT;                         // Clear SW1 IFG
    SW2_PORT_IFG &= ~SW2_BIT;                         // Clear SW2 IFG

    timerA0_init();
    timer1_PWM_start();
    __bis_SR_register(/*LPM0_bits +*/ GIE);     // let MCU as always on

    // animation effect
    ssd1306_printString(0, 0, " Gardening", FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 2, " LED v1.0", FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 4, " Made by", FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 6, " Ernest Cho", FONT_MS_GOTHIC8x16);
    delay_ms(1000);

    //ssd1306_clearDisplay();
    ssd1306_clear_one_line(0);
    ssd1306_clear_one_line(1);
    delay_ms(100);
    ssd1306_clear_one_line(2);
    ssd1306_clear_one_line(3);
    delay_ms(100);
    ssd1306_clear_one_line(4);
    ssd1306_clear_one_line(5);
    delay_ms(100);
    ssd1306_clear_one_line(6);
    ssd1306_clear_one_line(7);
    delay_ms(100);

