ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c
    read_infoFlash();
    TA1CCR1 = pwm0_duty = pwm0_duty_target;
    TA1CCR2 = pwm1_duty = pwm1_duty_target;
    tick_5ms = 0;

    switch_status |= BIT0;

    menu = MENU_IDLE;
    while(1)
    {
        ///////////////////////////////////////////////////
        // check switch buttons are pressed : SW1
        ///////////////////////////////////////////////////
        if(switch_status & BIT0) // switch1 function : menu change
        {
            menu++;
            if(menu >= MENU_MAX)   // end? then repeat first
            {
                menu = MENU_PWM0_SETTING;
            }

            ssd1306_clearDisplay();
            if(menu == MENU_PWM0_SETTING)
            {
                display_pwm0H_pwm1L_info();
            }
            else if(menu == MENU_PWM1_SETTING)
            {
                display_pwm1H_pwm0L_info();
            }

#if !defined (SIMPLE_GUI)
            // this part is a kind of minor setting
            else if(menu == MENU_PWM_DUTY_INC_RATE || menu == MENU_PWM_CHANGE_STEP_LINAR || menu == MENU_LED_ON_TIME_SET || menu == MENU_BEEP_ON_OFF)
            {
                // display PWM0, PWM1 info
                display_pwm0L_pwm1L_info();

                if(menu == MENU_PWM_DUTY_INC_RATE)
                {
                    ssd1306_printString(0, 3, "3.increase %:", FONT_6x8);      // 5%, 10%, 20%

                    //display_pwm_incr_rate_info();
                    if(pwm_duty_increase_rate == PWM_DUTY_INC_5_PERCENT)
                        strcpy(disp_buf, "+ 5%");
                    else if(pwm_duty_increase_rate == PWM_DUTY_INC_10_PERCENT)
                        strcpy(disp_buf, "+10%");
                    else
                        strcpy(disp_buf, "+20%");
                    ssd1306_printString(84, 3, disp_buf, FONT_MS_GOTHIC8x16);      // 5%, 10%, 20%

                }
                else if(menu == MENU_PWM_CHANGE_STEP_LINAR)
                {
                    ssd1306_printString(0, 4, "4.Dim:", FONT_6x8);         // instant(step), linear

                    if(led_dimming_change_method == LED_DIMMING_CHANGE_STEP)
                        strcpy(disp_buf, "Step  ");
                    else
                        strcpy(disp_buf, "Linear");
                    ssd1306_printString(56, 4, disp_buf, FONT_MS_GOTHIC8x16);
                }
                else if(menu == MENU_LED_ON_TIME_SET)
                {
                    ssd1306_printString(0, 5, "5.Timer:", FONT_6x8);         // 1hr -> 10hr

                    strcpy(disp_buf, " ");
                    ltoa(led_on_time_hr, tmp_buf);
                    strcat(disp_buf, tmp_buf);
                    strcat(disp_buf, "H");
                    ssd1306_printString(70, 5, disp_buf, FONT_MS_GOTHIC8x16);
                }
                else if(menu == MENU_BEEP_ON_OFF)
                {
                    ssd1306_printString(0, 6, "6.BEEP:", FONT_6x8);      // on, off

                    if(beep_on_off == ON)
                        strcpy(disp_buf, " On");
                    else
                        strcpy(disp_buf, " Off");
                    ssd1306_printString(64, 6, disp_buf, FONT_MS_GOTHIC8x16);
                }
                else
                {
                    ssd1306_printString(0, 0, "Nothing to do1..", FONT_6x8);

                }
            }
#endif // (SIMPLE_GUI)

            else if(menu == MENU_DISP_STATUS)
            {
                ssd1306_printString(0, 0, "====Status====", FONT_6x8);          // temp, humidity

                hdc1080_read_display();

                strcpy(disp_buf, " ");
#ifdef CCS_VER9
                ltoa(led_on_time_hr, tmp_buf);
#else
                ltoa(led_on_time_hr, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, "Hr");
                ssd1306_printString(0, 6, disp_buf, FONT_MS_GOTHIC8x16);
            }
            else
            {
                ssd1306_printString(0, 0, "Nothing to do2..", FONT_6x8);

            }


            switch_status &= ~BIT0;
        }

        /////////////////////////////////////////////////
        // check switch buttons are pressed : SW2
        /////////////////////////////////////////////////
        if(switch_status & BIT1)    // switch2 function : status change
        {
            if(menu == MENU_PWM0_SETTING)
            {
                pwm0_duty_target += pwm_duty_increase_rate;
                if(pwm0_duty_target > PWM_MAX_DUTY)
                {
                    pwm0_duty_target = 0;
                }

                display_pwm0H_pwm1L_info();

            }
            else if(menu == MENU_PWM1_SETTING)
            {
                pwm1_duty_target += pwm_duty_increase_rate;
                if(pwm1_duty_target > PWM_MAX_DUTY)
                {
                    pwm1_duty_target = 0;
                }

                display_pwm1H_pwm0L_info();
            }

#if !defined (SIMPLE_GUI)
            // this part is a kind of minor setting
            else if(menu == MENU_PWM_DUTY_INC_RATE || MENU_PWM_CHANGE_STEP_LINAR || MENU_LED_ON_TIME_SET || MENU_BEEP_ON_OFF)
            {
                // display PWM0, PWM1 info
                display_pwm0L_pwm1L_info();

                if(menu == MENU_PWM_DUTY_INC_RATE)
                {
                    if(pwm_duty_increase_rate == PWM_DUTY_INC_5_PERCENT)
                        pwm_duty_increase_rate = PWM_DUTY_INC_10_PERCENT;
                    else if(pwm_duty_increase_rate == PWM_DUTY_INC_10_PERCENT)
                        pwm_duty_increase_rate = PWM_DUTY_INC_20_PERCENT;
                    else
                        pwm_duty_increase_rate = PWM_DUTY_INC_5_PERCENT;

                    //display_pwm_incr_rate_info();
                    if(pwm_duty_increase_rate == PWM_DUTY_INC_5_PERCENT)
                        strcpy(disp_buf, "+5%");
                    else if(pwm_duty_increase_rate == PWM_DUTY_INC_10_PERCENT)
                        strcpy(disp_buf, "+10%");
                    else
                        strcpy(disp_buf, "+20%");
                    ssd1306_printString(86, 3, disp_buf, FONT_MS_GOTHIC8x16);      // 5%, 10%, 20%
                }
                else if(menu == MENU_PWM_CHANGE_STEP_LINAR)
                {
                    if(led_dimming_change_method == LED_DIMMING_CHANGE_STEP)
                        led_dimming_change_method = LED_DIMMING_CHANGE_LINEAR;
                    else
                        led_dimming_change_method = LED_DIMMING_CHANGE_STEP;


                    if(led_dimming_change_method == LED_DIMMING_CHANGE_STEP)
                        strcpy(disp_buf, "Step");
                    else
                        strcpy(disp_buf, "Linear");
                    ssd1306_printString(56, 4, disp_buf, FONT_MS_GOTHIC8x16);
                }
                else if(menu == MENU_LED_ON_TIME_SET)
                {
                    led_on_time_hr += LED_ON_TIME_1HR;
                    if(led_on_time_hr > LED_ON_TIME_MAX)
                    {
                        led_on_time_hr = LED_ON_TIME_1HR;
                    }

                    strcpy(disp_buf, " ");
                    ltoa(led_on_time_hr, tmp_buf);
                    strcat(disp_buf, tmp_buf);
                    strcat(disp_buf, "H");
                    ssd1306_printString(76, 5, disp_buf, FONT_MS_GOTHIC8x16);
                }
                else if(menu == MENU_BEEP_ON_OFF)
                {
                    if(beep_on_off == ON)
                        beep_on_off = OFF;
                    else
                        beep_on_off = ON;


