ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c
                    if(beep_on_off == ON)
                        strcpy(disp_buf, " On");
                    else
                        strcpy(disp_buf, " Off");
                    ssd1306_printString(64, 6, disp_buf, FONT_MS_GOTHIC8x16);
                }
            }
#endif
            else if(menu == MENU_DISP_STATUS)
            {

            }


            switch_status &= ~BIT1;
        }
        /////////////////////////////////////////////////
        // actions for case by case of the buttons
        /////////////////////////////////////////////////
        switch (menu)
        {
            case MENU_PWM0_SETTING :
            {
                if(led_dimming_change_method == LED_DIMMING_CHANGE_STEP)
                {
                    pwm0_duty = pwm0_duty_target;
                    if(pwm0_duty > 1000)
                    {
                        pwm0_duty = 0;
                    }
                    TA1CCR1 = pwm0_duty;
                }
                else if(led_dimming_change_method == LED_DIMMING_CHANGE_LINEAR)
                {
                    if(tick_5ms == 1)
                    {
                        if(pwm0_duty_target > pwm0_duty)
                        {
                            if(pwm0_duty <= 990)
                                pwm0_duty += 10;
                            else
                                pwm0_duty = 1000;

                            strcpy(disp_buf, " ");
#ifdef CCS_VER9
                            ltoa( pwm0_duty, tmp_buf);
#else
                            ltoa( pwm0_duty, tmp_buf, 10);
#endif
                            strcat(disp_buf, tmp_buf);
                            strcat(disp_buf, "   ");
                            ssd1306_printString(0, 5, disp_buf, FONT_6x8);

                        }
                        else if(pwm0_duty_target < pwm0_duty)
                        {
                            if(pwm0_duty >= 10)
                                pwm0_duty -= 10;
                            else
                                pwm0_duty = 0;

                            strcpy(disp_buf, " ");
#ifdef CCS_VER9
                            ltoa( pwm0_duty, tmp_buf);
#else
                            ltoa( pwm0_duty, tmp_buf, 10);
#endif
                            strcat(disp_buf, tmp_buf);
                            strcat(disp_buf, "   ");
                            ssd1306_printString(0, 5, disp_buf, FONT_6x8);

                        }
                        TA1CCR1 = pwm0_duty;
                        tick_5ms = 0;

                    }
                }
            }break;
            case MENU_PWM1_SETTING :
            {
                if(led_dimming_change_method == LED_DIMMING_CHANGE_STEP)
                {
                    pwm1_duty = pwm1_duty_target;
                    if(pwm1_duty > 1000)
                    {
                        pwm1_duty = 0;
                    }
                    TA1CCR2 = pwm1_duty;
                }
                else if(led_dimming_change_method == LED_DIMMING_CHANGE_LINEAR)
                {
                    if(tick_5ms == 1)
                    {
                        if(pwm1_duty_target > pwm1_duty)
                        {
                            if(pwm1_duty <= 990)
                                pwm1_duty += 10;
                            else
                                pwm1_duty = 1000;

                            strcpy(disp_buf, " ");
#ifdef CCS_VER9
                            ltoa( pwm1_duty, tmp_buf);
#else
                            ltoa( pwm1_duty, tmp_buf, 10);
#endif
                            strcat(disp_buf, tmp_buf);
                            strcat(disp_buf, "   ");
                            ssd1306_printString(0, 5, disp_buf, FONT_6x8);

                        }
                        else if(pwm1_duty_target < pwm1_duty)
                        {
                            if(pwm1_duty >= 10)
                                pwm1_duty -= 10;
                            else
                                pwm1_duty = 0;

                            strcpy(disp_buf, " ");
#ifdef CCS_VER9
                            ltoa( pwm1_duty, tmp_buf);
#else
                            ltoa( pwm1_duty, tmp_buf, 10);
#endif
                            strcat(disp_buf, tmp_buf);
                            strcat(disp_buf, "   ");
                            ssd1306_printString(0, 5, disp_buf, FONT_6x8);
                        }
                        TA1CCR2 = pwm1_duty;
                        tick_5ms = 0;
                    }
                }
            }break;
#if !defined (SIMPLE_GUI)
            case MENU_PWM_DUTY_INC_RATE :
            {

            }break;
            case MENU_PWM_CHANGE_STEP_LINAR :
            {
            }break;
            case MENU_LED_ON_TIME_SET :
            {
            }break;
            case MENU_BEEP_ON_OFF :
            {
            }break;
#endif // SIMPLE_GUI
            case MENU_DISP_STATUS :
            {
                write_infoFlash();
            }break;
            default : break;
        }


    }


}

///////////////////////////////////////////////////////////////////////
// Timer Interrupt handler part
///////////////////////////////////////////////////////////////////////
// 5ms continuous mode timer
#pragma vector=TIMER0_A0_VECTOR
__interrupt void ISR_Timer0_A0(void)
{
    TA0CCR0 += CONST_TIMER0_CCR0;               // Add Offset to CCR1

    tick_5ms = 1;
//    timer_cnt++;
//    if(timer_cnt >= ONE_HOUR_FROM_50ms_Tick)        //ONE_MIN_FROM_50ms_Tick : test for shortening the time
//    {
//        timer_cnt = 0;

//        led_mode = LED_ACTION_MAX;          // will generate sleep at the main loop
//        switch_status |= BIT0;              // generate emulated signal of button press..
//    }
}


#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1A2(void)
{
    switch( TA0IV )
    {
        case  2:                                        // CCR1
        {
//            TA0CCR1 += CONST_TIMER0_CCR1;               // Add Offset to CCR1

