ErnestCho/ccs_workspace_v12_msp_projects/msp430g2553_tps61169_tps92360_gardening_LED/main_msp430g2553_tps61169_92630_gardening_LED.c
        }
        break;
        case  4:                                        // CCR2
        {
//            TA0CCR2 += CONST_TIMER0_CCR2;               // Add Offset to CCR2

        } break;
        case 10:                                        // TA0 Overflow
        {
            //P1OUT ^= LED_TA0_OVF;
        } break;
    }
}

///////////////////////////////////////////////////////////////////////
// Port External Interrupt handler part
///////////////////////////////////////////////////////////////////////

// Port 1 interrupt service routine
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    // switch 1 detection ==> sw1 function : mode change
    if(SW1_PORT_IFG & SW1_BIT)
    {
        SW1_PORT_IFG &= ~SW1_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT1)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT0;

            //timer_cnt = 0;
        }
    }

    else
    {
        SW1_PORT_IFG &= ~SW1_BIT;
    }

    // switch 2 detection ==> sw2 function : brightness control
    if(SW2_PORT_IFG & SW2_BIT)
    {
        SW2_PORT_IFG &= ~SW2_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT0)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT1;

            //timer_cnt = 0;
        }
    }

    else
    {
        SW2_PORT_IFG &= ~SW2_BIT;
    }

}





